{
  "format": "layers-model",
  "generatedBy": "keras v2.11.0",
  "convertedBy": "TensorFlow.js Converter v4.2.0",
  "modelTopology": {
    "keras_version": "2.11.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "model_1",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 256, 256, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_2"
            },
            "name": "input_2",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_9",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              
              "bias_regularizer": null,
              "activity_regularizer": null,
              
              "bias_constraint": null
            },
            "name": "conv2d_9",
            "inbound_nodes": [[["input_2", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_55",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_55",
            "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_55",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_55",
            "inbound_nodes": [[["batch_normalization_55", 0, 0, {}]]]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_46",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {},
                "shared_object_id": 12
              },
              
              "bias_regularizer": null,
              "activity_regularizer": null,
              
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "pointwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_46",
            "inbound_nodes": [[["re_lu_55", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_56",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_56",
            "inbound_nodes": [[["separable_conv2d_46", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_56",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_56",
            "inbound_nodes": [[["batch_normalization_56", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_57",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_57",
            "inbound_nodes": [[["re_lu_56", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_57",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_57",
            "inbound_nodes": [[["batch_normalization_57", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "add_27",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "add_27",
            "inbound_nodes": [
              [
                ["re_lu_57", 0, 0, {}],
                ["re_lu_55", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_10",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [2, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
            
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              
              "bias_regularizer": null,
              "activity_regularizer": null,
              
              "bias_constraint": null
            },
            "name": "conv2d_10",
            "inbound_nodes": [[["add_27", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_58",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_58",
            "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_58",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_58",
            "inbound_nodes": [[["batch_normalization_58", 0, 0, {}]]]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_48",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
            
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {},
                "shared_object_id": 39
              },
              
              "bias_regularizer": null,
              "activity_regularizer": null,
              
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "pointwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_48",
            "inbound_nodes": [[["re_lu_58", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_59",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_59",
            "inbound_nodes": [[["separable_conv2d_48", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_59",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_59",
            "inbound_nodes": [[["batch_normalization_59", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_60",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_60",
            "inbound_nodes": [[["re_lu_59", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_60",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_60",
            "inbound_nodes": [[["batch_normalization_60", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "add_28",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "add_28",
            "inbound_nodes": [
              [
                ["re_lu_60", 0, 0, {}],
                ["re_lu_58", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_11",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [2, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
            
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              
              "bias_regularizer": null,
              "activity_regularizer": null,
              
              "bias_constraint": null
            },
            "name": "conv2d_11",
            "inbound_nodes": [[["add_28", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_61",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_61",
            "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_61",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_61",
            "inbound_nodes": [[["batch_normalization_61", 0, 0, {}]]]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_50",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
            
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {},
                "shared_object_id": 66
              },
              
              "bias_regularizer": null,
              "activity_regularizer": null,
              
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "pointwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_50",
            "inbound_nodes": [[["re_lu_61", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_62",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_62",
            "inbound_nodes": [[["separable_conv2d_50", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_62",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_62",
            "inbound_nodes": [[["batch_normalization_62", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_63",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_63",
            "inbound_nodes": [[["re_lu_62", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_63",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_63",
            "inbound_nodes": [[["batch_normalization_63", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "add_29",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "add_29",
            "inbound_nodes": [
              [
                ["re_lu_63", 0, 0, {}],
                ["re_lu_61", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_12",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [2, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
            
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              
              "bias_regularizer": null,
              "activity_regularizer": null,
              
              "bias_constraint": null
            },
            "name": "conv2d_12",
            "inbound_nodes": [[["add_29", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_64",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_64",
            "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_64",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_64",
            "inbound_nodes": [[["batch_normalization_64", 0, 0, {}]]]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_52",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
            
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {},
                "shared_object_id": 93
              },
              
              "bias_regularizer": null,
              "activity_regularizer": null,
              
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "pointwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_52",
            "inbound_nodes": [[["re_lu_64", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_65",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_65",
            "inbound_nodes": [[["separable_conv2d_52", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_65",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_65",
            "inbound_nodes": [[["batch_normalization_65", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_66",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_66",
            "inbound_nodes": [[["re_lu_65", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_66",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_66",
            "inbound_nodes": [[["batch_normalization_66", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "add_30",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "add_30",
            "inbound_nodes": [
              [
                ["re_lu_66", 0, 0, {}],
                ["re_lu_64", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_54",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
            
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {},
                "shared_object_id": 111
              },
              
              "bias_regularizer": null,
              "activity_regularizer": null,
              
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "pointwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_54",
            "inbound_nodes": [[["add_30", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_67",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_67",
            "inbound_nodes": [[["separable_conv2d_54", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_67",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_67",
            "inbound_nodes": [[["batch_normalization_67", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_68",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_68",
            "inbound_nodes": [[["re_lu_67", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_68",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_68",
            "inbound_nodes": [[["batch_normalization_68", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "add_31",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "add_31",
            "inbound_nodes": [
              [
                ["re_lu_68", 0, 0, {}],
                ["add_30", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_13",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [2, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
            
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              
              "bias_regularizer": null,
              "activity_regularizer": null,
              
              "bias_constraint": null
            },
            "name": "conv2d_13",
            "inbound_nodes": [[["add_31", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_69",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_69",
            "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_69",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_69",
            "inbound_nodes": [[["batch_normalization_69", 0, 0, {}]]]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_56",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
            
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {},
                "shared_object_id": 138
              },
              
              "bias_regularizer": null,
              "activity_regularizer": null,
              
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "pointwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_56",
            "inbound_nodes": [[["re_lu_69", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_70",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_70",
            "inbound_nodes": [[["separable_conv2d_56", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_70",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_70",
            "inbound_nodes": [[["batch_normalization_70", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_71",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_71",
            "inbound_nodes": [[["re_lu_70", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_71",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_71",
            "inbound_nodes": [[["batch_normalization_71", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "add_32",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "add_32",
            "inbound_nodes": [
              [
                ["re_lu_71", 0, 0, {}],
                ["re_lu_69", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_58",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
            
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {},
                "shared_object_id": 156
              },
              
              "bias_regularizer": null,
              "activity_regularizer": null,
              
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "pointwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_58",
            "inbound_nodes": [[["add_32", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_72",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_72",
            "inbound_nodes": [[["separable_conv2d_58", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_72",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_72",
            "inbound_nodes": [[["batch_normalization_72", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_73",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_73",
            "inbound_nodes": [[["re_lu_72", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_73",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_73",
            "inbound_nodes": [[["batch_normalization_73", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "add_33",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "add_33",
            "inbound_nodes": [
              [
                ["re_lu_73", 0, 0, {}],
                ["add_32", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_60",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
            
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {},
                "shared_object_id": 174
              },
              
              "bias_regularizer": null,
              "activity_regularizer": null,
              
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "pointwise_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_60",
            "inbound_nodes": [[["add_33", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_74",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_74",
            "inbound_nodes": [[["separable_conv2d_60", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_74",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_74",
            "inbound_nodes": [[["batch_normalization_74", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_75",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_75",
            "inbound_nodes": [[["re_lu_74", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_75",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_75",
            "inbound_nodes": [[["batch_normalization_75", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "add_34",
              "trainable": true,
              "dtype": "float32"
            },
